program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "1.13.1"}, {"coremltools-version", "6.3.0"}})]
{
    func main<ios15>(tensor<int32, [1, ?]> attention_mask, tensor<int32, [1, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"attention_mask", [1, 1]}, {"input_ids", [1, 1]}}), ("RangeDims", {{"attention_mask", [[1, 1], [1, 128]]}, {"input_ids", [[1, 1], [1, 128]]}})))] {
            tensor<int32, [1, 512]> model_embeddings_token_type_ids = const()[name = tensor<string, []>("model_embeddings_token_type_ids"), val = tensor<int32, [1, 512]>([[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]])];
            tensor<int32, [1, 512]> model_embeddings_position_ids = const()[name = tensor<string, []>("model_embeddings_position_ids"), val = tensor<int32, [1, 512]>([[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511]])];
            tensor<int32, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<int32, []>(32)];
            tensor<int32, []> var_7 = const()[name = tensor<string, []>("op_7"), val = tensor<int32, []>(12)];
            tensor<int32, []> var_8 = const()[name = tensor<string, []>("op_8"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_11 = const()[name = tensor<string, []>("op_11"), val = tensor<int32, []>(384)];
            tensor<int32, [2]> var_27_shape = shape(x = input_ids);
            tensor<int32, []> gather_1_indices_0 = const()[name = tensor<string, []>("gather_1_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_1_axis_0 = const()[name = tensor<string, []>("gather_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_1 = gather(axis = gather_1_axis_0, indices = gather_1_indices_0, x = var_27_shape);
            tensor<int32, []> concat_0_values0_0 = const()[name = tensor<string, []>("concat_0_values0_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> concat_0_axis_0 = const()[name = tensor<string, []>("concat_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_0_interleave_0 = const()[name = tensor<string, []>("concat_0_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [2]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (concat_0_values0_0, gather_1));
            tensor<int32, [2]> buffered_token_type_ids_begin_0 = const()[name = tensor<string, []>("buffered_token_type_ids_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> buffered_token_type_ids_end_mask_0 = const()[name = tensor<string, []>("buffered_token_type_ids_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<int32, [1, ?]> buffered_token_type_ids = slice_by_index(begin = buffered_token_type_ids_begin_0, end = concat_0, end_mask = buffered_token_type_ids_end_mask_0, x = model_embeddings_token_type_ids);
            tensor<int32, [2]> shape_0 = shape(x = buffered_token_type_ids);
            tensor<int32, [2]> real_div_0 = real_div(x = concat_0, y = shape_0);
            tensor<int32, [?, ?]> input_1 = tile(reps = real_div_0, x = buffered_token_type_ids);
            tensor<int32, [1]> var_34_axes_0 = const()[name = tensor<string, []>("op_34_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1, 1, ?]> var_34 = expand_dims(axes = var_34_axes_0, x = attention_mask);
            tensor<int32, [1]> var_35_axes_0 = const()[name = tensor<string, []>("op_35_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1, 1, 1, ?]> var_35 = expand_dims(axes = var_35_axes_0, x = var_34);
            tensor<fp16, []> var_13_to_fp16 = const()[name = tensor<string, []>("op_13_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<string, []> var_37_to_fp16_dtype_0 = const()[name = tensor<string, []>("op_37_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, ?]> cast_375 = cast(dtype = var_37_to_fp16_dtype_0, x = var_35);
            tensor<fp16, [1, 1, 1, ?]> var_38_cast = sub(x = var_13_to_fp16, y = cast_375);
            tensor<string, []> var_38_cast_to_fp32_dtype_0 = const()[name = tensor<string, []>("op_38_cast_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp32, []> var_39 = const()[name = tensor<string, []>("op_39"), val = tensor<fp32, []>(-0x1.fffffep+127)];
            tensor<fp32, [1, 1, 1, ?]> cast_374 = cast(dtype = var_38_cast_to_fp32_dtype_0, x = var_38_cast);
            tensor<fp32, [1, 1, 1, ?]> attention_mask_1 = mul(x = cast_374, y = var_39);
            tensor<int32, [2]> input_3_begin_0 = const()[name = tensor<string, []>("input_3_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> input_3_end_mask_0 = const()[name = tensor<string, []>("input_3_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<int32, [1, ?]> input_3 = slice_by_index(begin = input_3_begin_0, end = concat_0, end_mask = input_3_end_mask_0, x = model_embeddings_position_ids);
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [250037, 384]> model_embeddings_word_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("model_embeddings_word_embeddings_weight_to_fp16"), val = tensor<fp16, [250037, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, ?, 384]> inputs_embeds_cast = gather(axis = inputs_embeds_axis_0, indices = input_ids, x = model_embeddings_word_embeddings_weight_to_fp16);
            tensor<int32, []> token_type_embeddings_1_axis_0 = const()[name = tensor<string, []>("token_type_embeddings_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [2, 384]> model_embeddings_token_type_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("model_embeddings_token_type_embeddings_weight_to_fp16"), val = tensor<fp16, [2, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192028544)))];
            tensor<fp16, [?, ?, 384]> token_type_embeddings_1_cast = gather(axis = token_type_embeddings_1_axis_0, indices = input_1, x = model_embeddings_token_type_embeddings_weight_to_fp16);
            tensor<fp16, [?, ?, 384]> embeddings_1_cast = add(x = inputs_embeds_cast, y = token_type_embeddings_1_cast);
            tensor<int32, []> position_embeddings_1_axis_0 = const()[name = tensor<string, []>("position_embeddings_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [512, 384]> model_embeddings_position_embeddings_weight_to_fp16 = const()[name = tensor<string, []>("model_embeddings_position_embeddings_weight_to_fp16"), val = tensor<fp16, [512, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192030144)))];
            tensor<fp16, [1, ?, 384]> position_embeddings_1_cast = gather(axis = position_embeddings_1_axis_0, indices = input_3, x = model_embeddings_position_embeddings_weight_to_fp16);
            tensor<fp16, [?, ?, 384]> input_5_cast = add(x = embeddings_1_cast, y = position_embeddings_1_cast);
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_embeddings_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("model_embeddings_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192423424)))];
            tensor<fp16, [384]> model_embeddings_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("model_embeddings_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192424256)))];
            tensor<fp16, []> var_10_to_fp16 = const()[name = tensor<string, []>("op_10_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [?, ?, 384]> input_7_cast = layer_norm(axes = input_7_axes_0, beta = model_embeddings_LayerNorm_bias_to_fp16, epsilon = var_10_to_fp16, gamma = model_embeddings_LayerNorm_weight_to_fp16, x = input_5_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192425088)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192720064)))];
            tensor<fp16, [?, ?, 384]> x_9_cast = linear(bias = model_encoder_layer_0_attention_self_query_bias_to_fp16, weight = model_encoder_layer_0_attention_self_query_weight_to_fp16, x = input_7_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192720896)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193015872)))];
            tensor<fp16, [?, ?, 384]> x_1_cast = linear(bias = model_encoder_layer_0_attention_self_key_bias_to_fp16, weight = model_encoder_layer_0_attention_self_key_weight_to_fp16, x = input_7_cast);
            tensor<int32, [3]> var_104_shape_cast = shape(x = x_1_cast);
            tensor<int32, []> gather_3_indices_0 = const()[name = tensor<string, []>("gather_3_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_3_axis_0 = const()[name = tensor<string, []>("gather_3_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_3 = gather(axis = gather_3_axis_0, indices = gather_3_indices_0, x = var_104_shape_cast);
            tensor<int32, []> gather_4_indices_0 = const()[name = tensor<string, []>("gather_4_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_4_axis_0 = const()[name = tensor<string, []>("gather_4_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_4 = gather(axis = gather_4_axis_0, indices = gather_4_indices_0, x = var_104_shape_cast);
            tensor<int32, []> concat_3_axis_0 = const()[name = tensor<string, []>("concat_3_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_3_interleave_0 = const()[name = tensor<string, []>("concat_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_3 = concat(axis = concat_3_axis_0, interleave = concat_3_interleave_0, values = (gather_3, gather_4, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_3_cast = reshape(shape = concat_3, x = x_1_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193016704)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193311680)))];
            tensor<fp16, [?, ?, 384]> x_5_cast = linear(bias = model_encoder_layer_0_attention_self_value_bias_to_fp16, weight = model_encoder_layer_0_attention_self_value_weight_to_fp16, x = input_7_cast);
            tensor<int32, [3]> var_113_shape_cast = shape(x = x_5_cast);
            tensor<int32, []> gather_5_indices_0 = const()[name = tensor<string, []>("gather_5_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_5_axis_0 = const()[name = tensor<string, []>("gather_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_5 = gather(axis = gather_5_axis_0, indices = gather_5_indices_0, x = var_113_shape_cast);
            tensor<int32, []> gather_6_indices_0 = const()[name = tensor<string, []>("gather_6_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_6_axis_0 = const()[name = tensor<string, []>("gather_6_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_6 = gather(axis = gather_6_axis_0, indices = gather_6_indices_0, x = var_113_shape_cast);
            tensor<int32, []> concat_4_axis_0 = const()[name = tensor<string, []>("concat_4_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_4_interleave_0 = const()[name = tensor<string, []>("concat_4_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_4 = concat(axis = concat_4_axis_0, interleave = concat_4_interleave_0, values = (gather_5, gather_6, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_7_cast = reshape(shape = concat_4, x = x_5_cast);
            tensor<int32, [4]> var_117 = const()[name = tensor<string, []>("op_117"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_119_shape_cast = shape(x = x_9_cast);
            tensor<int32, []> gather_7_indices_0 = const()[name = tensor<string, []>("gather_7_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_7_axis_0 = const()[name = tensor<string, []>("gather_7_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_7 = gather(axis = gather_7_axis_0, indices = gather_7_indices_0, x = var_119_shape_cast);
            tensor<int32, []> gather_8_indices_0 = const()[name = tensor<string, []>("gather_8_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_8_axis_0 = const()[name = tensor<string, []>("gather_8_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_8 = gather(axis = gather_8_axis_0, indices = gather_8_indices_0, x = var_119_shape_cast);
            tensor<int32, []> concat_5_axis_0 = const()[name = tensor<string, []>("concat_5_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_5_interleave_0 = const()[name = tensor<string, []>("concat_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_5 = concat(axis = concat_5_axis_0, interleave = concat_5_interleave_0, values = (gather_7, gather_8, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_11_cast = reshape(shape = concat_5, x = x_9_cast);
            tensor<bool, []> attention_scores_1_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_1_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_12_perm_0 = const()[name = tensor<string, []>("transpose_12_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_13_perm_0 = const()[name = tensor<string, []>("transpose_13_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [?, 12, 32, ?]> transpose_81 = transpose(perm = transpose_13_perm_0, x = x_3_cast);
            tensor<fp16, [?, 12, ?, 32]> transpose_82 = transpose(perm = transpose_12_perm_0, x = x_11_cast);
            tensor<fp16, [?, 12, ?, ?]> attention_scores_1_cast = matmul(transpose_x = attention_scores_1_transpose_x_0, transpose_y = attention_scores_1_transpose_y_0, x = transpose_82, y = transpose_81);
            tensor<fp16, []> _inversed_attention_scores_3_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_attention_scores_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [?, 12, ?, ?]> _inversed_attention_scores_3_cast = mul(x = attention_scores_1_cast, y = _inversed_attention_scores_3_y_0_to_fp16);
            tensor<string, []> attention_mask_to_fp16_dtype_0 = const()[name = tensor<string, []>("attention_mask_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1, ?]> cast_356 = cast(dtype = attention_mask_to_fp16_dtype_0, x = attention_mask_1);
            tensor<fp16, [?, 12, ?, ?]> input_11_cast = add(x = _inversed_attention_scores_3_cast, y = cast_356);
            tensor<fp16, [?, 12, ?, ?]> input_13_cast = softmax(axis = var_8, x = input_11_cast);
            tensor<bool, []> context_layer_1_transpose_x_0 = const()[name = tensor<string, []>("context_layer_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_layer_1_transpose_y_0 = const()[name = tensor<string, []>("context_layer_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 12, ?, 32]> transpose_83 = transpose(perm = var_117, x = x_7_cast);
            tensor<fp16, [?, 12, ?, 32]> context_layer_1_cast = matmul(transpose_x = context_layer_1_transpose_x_0, transpose_y = context_layer_1_transpose_y_0, x = input_13_cast, y = transpose_83);
            tensor<int32, [4]> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 32]> transpose_80 = transpose(perm = var_133, x = context_layer_1_cast);
            tensor<int32, [4]> var_136_shape_cast = shape(x = transpose_80);
            tensor<int32, []> gather_9_indices_0 = const()[name = tensor<string, []>("gather_9_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_9_axis_0 = const()[name = tensor<string, []>("gather_9_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_9 = gather(axis = gather_9_axis_0, indices = gather_9_indices_0, x = var_136_shape_cast);
            tensor<int32, []> gather_10_indices_0 = const()[name = tensor<string, []>("gather_10_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_10_axis_0 = const()[name = tensor<string, []>("gather_10_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_10 = gather(axis = gather_10_axis_0, indices = gather_10_indices_0, x = var_136_shape_cast);
            tensor<int32, []> concat_6_axis_0 = const()[name = tensor<string, []>("concat_6_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_6_interleave_0 = const()[name = tensor<string, []>("concat_6_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_6 = concat(axis = concat_6_axis_0, interleave = concat_6_interleave_0, values = (gather_9, gather_10, var_11));
            tensor<fp16, [?, ?, 384]> input_15_cast = reshape(shape = concat_6, x = transpose_80);
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193312512)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193607488)))];
            tensor<fp16, [?, ?, 384]> input_17_cast = linear(bias = model_encoder_layer_0_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_0_attention_output_dense_weight_to_fp16, x = input_15_cast);
            tensor<fp16, [?, ?, 384]> input_19_cast = add(x = input_17_cast, y = input_7_cast);
            tensor<int32, [1]> input_21_axes_0 = const()[name = tensor<string, []>("input_21_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193608320)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193609152)))];
            tensor<fp16, [?, ?, 384]> input_21_cast = layer_norm(axes = input_21_axes_0, beta = model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16, epsilon = var_10_to_fp16, gamma = model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16, x = input_19_cast);
            tensor<fp16, [1536, 384]> model_encoder_layer_0_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193609984)))];
            tensor<fp16, [1536]> model_encoder_layer_0_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(194789696)))];
            tensor<fp16, [?, ?, 1536]> input_23_cast = linear(bias = model_encoder_layer_0_intermediate_dense_bias_to_fp16, weight = model_encoder_layer_0_intermediate_dense_weight_to_fp16, x = input_21_cast);
            tensor<string, []> input_25_mode_0 = const()[name = tensor<string, []>("input_25_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [?, ?, 1536]> input_25_cast = gelu(mode = input_25_mode_0, x = input_23_cast);
            tensor<fp16, [384, 1536]> model_encoder_layer_0_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(194792832)))];
            tensor<fp16, [384]> model_encoder_layer_0_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195972544)))];
            tensor<fp16, [?, ?, 384]> input_27_cast = linear(bias = model_encoder_layer_0_output_dense_bias_to_fp16, weight = model_encoder_layer_0_output_dense_weight_to_fp16, x = input_25_cast);
            tensor<fp16, [?, ?, 384]> input_29_cast = add(x = input_27_cast, y = input_21_cast);
            tensor<int32, [1]> input_31_axes_0 = const()[name = tensor<string, []>("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195973376)))];
            tensor<fp16, [384]> model_encoder_layer_0_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_0_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195974208)))];
            tensor<fp16, [?, ?, 384]> input_31_cast = layer_norm(axes = input_31_axes_0, beta = model_encoder_layer_0_output_LayerNorm_bias_to_fp16, epsilon = var_10_to_fp16, gamma = model_encoder_layer_0_output_LayerNorm_weight_to_fp16, x = input_29_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195975040)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196270016)))];
            tensor<fp16, [?, ?, 384]> x_21_cast = linear(bias = model_encoder_layer_1_attention_self_query_bias_to_fp16, weight = model_encoder_layer_1_attention_self_query_weight_to_fp16, x = input_31_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196270848)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196565824)))];
            tensor<fp16, [?, ?, 384]> x_13_cast = linear(bias = model_encoder_layer_1_attention_self_key_bias_to_fp16, weight = model_encoder_layer_1_attention_self_key_weight_to_fp16, x = input_31_cast);
            tensor<int32, [3]> var_181_shape_cast = shape(x = x_13_cast);
            tensor<int32, []> gather_11_indices_0 = const()[name = tensor<string, []>("gather_11_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_11_axis_0 = const()[name = tensor<string, []>("gather_11_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_11 = gather(axis = gather_11_axis_0, indices = gather_11_indices_0, x = var_181_shape_cast);
            tensor<int32, []> gather_12_indices_0 = const()[name = tensor<string, []>("gather_12_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_12_axis_0 = const()[name = tensor<string, []>("gather_12_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_12 = gather(axis = gather_12_axis_0, indices = gather_12_indices_0, x = var_181_shape_cast);
            tensor<int32, []> concat_7_axis_0 = const()[name = tensor<string, []>("concat_7_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_7_interleave_0 = const()[name = tensor<string, []>("concat_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_7 = concat(axis = concat_7_axis_0, interleave = concat_7_interleave_0, values = (gather_11, gather_12, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_15_cast = reshape(shape = concat_7, x = x_13_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196566656)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196861632)))];
            tensor<fp16, [?, ?, 384]> x_17_cast = linear(bias = model_encoder_layer_1_attention_self_value_bias_to_fp16, weight = model_encoder_layer_1_attention_self_value_weight_to_fp16, x = input_31_cast);
            tensor<int32, [3]> var_190_shape_cast = shape(x = x_17_cast);
            tensor<int32, []> gather_13_indices_0 = const()[name = tensor<string, []>("gather_13_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_13_axis_0 = const()[name = tensor<string, []>("gather_13_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_13 = gather(axis = gather_13_axis_0, indices = gather_13_indices_0, x = var_190_shape_cast);
            tensor<int32, []> gather_14_indices_0 = const()[name = tensor<string, []>("gather_14_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_14_axis_0 = const()[name = tensor<string, []>("gather_14_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_14 = gather(axis = gather_14_axis_0, indices = gather_14_indices_0, x = var_190_shape_cast);
            tensor<int32, []> concat_8_axis_0 = const()[name = tensor<string, []>("concat_8_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_8_interleave_0 = const()[name = tensor<string, []>("concat_8_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_8 = concat(axis = concat_8_axis_0, interleave = concat_8_interleave_0, values = (gather_13, gather_14, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_19_cast = reshape(shape = concat_8, x = x_17_cast);
            tensor<int32, [4]> var_194 = const()[name = tensor<string, []>("op_194"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_196_shape_cast = shape(x = x_21_cast);
            tensor<int32, []> gather_15_indices_0 = const()[name = tensor<string, []>("gather_15_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_15_axis_0 = const()[name = tensor<string, []>("gather_15_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_15 = gather(axis = gather_15_axis_0, indices = gather_15_indices_0, x = var_196_shape_cast);
            tensor<int32, []> gather_16_indices_0 = const()[name = tensor<string, []>("gather_16_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_16_axis_0 = const()[name = tensor<string, []>("gather_16_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_16 = gather(axis = gather_16_axis_0, indices = gather_16_indices_0, x = var_196_shape_cast);
            tensor<int32, []> concat_9_axis_0 = const()[name = tensor<string, []>("concat_9_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_9_interleave_0 = const()[name = tensor<string, []>("concat_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_9 = concat(axis = concat_9_axis_0, interleave = concat_9_interleave_0, values = (gather_15, gather_16, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_23_cast = reshape(shape = concat_9, x = x_21_cast);
            tensor<bool, []> attention_scores_5_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_5_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_14_perm_0 = const()[name = tensor<string, []>("transpose_14_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_15_perm_0 = const()[name = tensor<string, []>("transpose_15_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [?, 12, 32, ?]> transpose_77 = transpose(perm = transpose_15_perm_0, x = x_15_cast);
            tensor<fp16, [?, 12, ?, 32]> transpose_78 = transpose(perm = transpose_14_perm_0, x = x_23_cast);
            tensor<fp16, [?, 12, ?, ?]> attention_scores_5_cast = matmul(transpose_x = attention_scores_5_transpose_x_0, transpose_y = attention_scores_5_transpose_y_0, x = transpose_78, y = transpose_77);
            tensor<fp16, []> _inversed_attention_scores_7_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_attention_scores_7_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [?, 12, ?, ?]> _inversed_attention_scores_7_cast = mul(x = attention_scores_5_cast, y = _inversed_attention_scores_7_y_0_to_fp16);
            tensor<fp16, [?, 12, ?, ?]> input_33_cast = add(x = _inversed_attention_scores_7_cast, y = cast_356);
            tensor<fp16, [?, 12, ?, ?]> input_35_cast = softmax(axis = var_8, x = input_33_cast);
            tensor<bool, []> context_layer_5_transpose_x_0 = const()[name = tensor<string, []>("context_layer_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_layer_5_transpose_y_0 = const()[name = tensor<string, []>("context_layer_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 12, ?, 32]> transpose_79 = transpose(perm = var_194, x = x_19_cast);
            tensor<fp16, [?, 12, ?, 32]> context_layer_5_cast = matmul(transpose_x = context_layer_5_transpose_x_0, transpose_y = context_layer_5_transpose_y_0, x = input_35_cast, y = transpose_79);
            tensor<int32, [4]> var_210 = const()[name = tensor<string, []>("op_210"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 32]> transpose_76 = transpose(perm = var_210, x = context_layer_5_cast);
            tensor<int32, [4]> var_213_shape_cast = shape(x = transpose_76);
            tensor<int32, []> gather_17_indices_0 = const()[name = tensor<string, []>("gather_17_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_17_axis_0 = const()[name = tensor<string, []>("gather_17_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_17 = gather(axis = gather_17_axis_0, indices = gather_17_indices_0, x = var_213_shape_cast);
            tensor<int32, []> gather_18_indices_0 = const()[name = tensor<string, []>("gather_18_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_18_axis_0 = const()[name = tensor<string, []>("gather_18_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_18 = gather(axis = gather_18_axis_0, indices = gather_18_indices_0, x = var_213_shape_cast);
            tensor<int32, []> concat_10_axis_0 = const()[name = tensor<string, []>("concat_10_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_10_interleave_0 = const()[name = tensor<string, []>("concat_10_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_10 = concat(axis = concat_10_axis_0, interleave = concat_10_interleave_0, values = (gather_17, gather_18, var_11));
            tensor<fp16, [?, ?, 384]> input_37_cast = reshape(shape = concat_10, x = transpose_76);
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196862464)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197157440)))];
            tensor<fp16, [?, ?, 384]> input_39_cast = linear(bias = model_encoder_layer_1_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_1_attention_output_dense_weight_to_fp16, x = input_37_cast);
            tensor<fp16, [?, ?, 384]> input_41_cast = add(x = input_39_cast, y = input_31_cast);
            tensor<int32, [1]> input_43_axes_0 = const()[name = tensor<string, []>("input_43_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_1_attention_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197158272)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197159104)))];
            tensor<fp16, [?, ?, 384]> input_43_cast = layer_norm(axes = input_43_axes_0, beta = model_encoder_layer_1_attention_output_LayerNorm_bias_to_fp16, epsilon = var_10_to_fp16, gamma = model_encoder_layer_1_attention_output_LayerNorm_weight_to_fp16, x = input_41_cast);
            tensor<fp16, [1536, 384]> model_encoder_layer_1_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197159936)))];
            tensor<fp16, [1536]> model_encoder_layer_1_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(198339648)))];
            tensor<fp16, [?, ?, 1536]> input_45_cast = linear(bias = model_encoder_layer_1_intermediate_dense_bias_to_fp16, weight = model_encoder_layer_1_intermediate_dense_weight_to_fp16, x = input_43_cast);
            tensor<string, []> input_47_mode_0 = const()[name = tensor<string, []>("input_47_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [?, ?, 1536]> input_47_cast = gelu(mode = input_47_mode_0, x = input_45_cast);
            tensor<fp16, [384, 1536]> model_encoder_layer_1_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(198342784)))];
            tensor<fp16, [384]> model_encoder_layer_1_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199522496)))];
            tensor<fp16, [?, ?, 384]> input_49_cast = linear(bias = model_encoder_layer_1_output_dense_bias_to_fp16, weight = model_encoder_layer_1_output_dense_weight_to_fp16, x = input_47_cast);
            tensor<fp16, [?, ?, 384]> input_51_cast = add(x = input_49_cast, y = input_43_cast);
            tensor<int32, [1]> input_53_axes_0 = const()[name = tensor<string, []>("input_53_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_1_output_LayerNorm_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199523328)))];
            tensor<fp16, [384]> model_encoder_layer_1_output_LayerNorm_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_1_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199524160)))];
            tensor<fp16, [?, ?, 384]> input_53_cast = layer_norm(axes = input_53_axes_0, beta = model_encoder_layer_1_output_LayerNorm_bias_to_fp16, epsilon = var_10_to_fp16, gamma = model_encoder_layer_1_output_LayerNorm_weight_to_fp16, x = input_51_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_self_query_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_2_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199524992)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_self_query_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_2_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199819968)))];
            tensor<fp16, [?, ?, 384]> x_33_cast = linear(bias = model_encoder_layer_2_attention_self_query_bias_to_fp16, weight = model_encoder_layer_2_attention_self_query_weight_to_fp16, x = input_53_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_self_key_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_2_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199820800)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_self_key_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_2_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(200115776)))];
            tensor<fp16, [?, ?, 384]> x_25_cast = linear(bias = model_encoder_layer_2_attention_self_key_bias_to_fp16, weight = model_encoder_layer_2_attention_self_key_weight_to_fp16, x = input_53_cast);
            tensor<int32, [3]> var_258_shape_cast = shape(x = x_25_cast);
            tensor<int32, []> gather_19_indices_0 = const()[name = tensor<string, []>("gather_19_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_19_axis_0 = const()[name = tensor<string, []>("gather_19_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_19 = gather(axis = gather_19_axis_0, indices = gather_19_indices_0, x = var_258_shape_cast);
            tensor<int32, []> gather_20_indices_0 = const()[name = tensor<string, []>("gather_20_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_20_axis_0 = const()[name = tensor<string, []>("gather_20_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_20 = gather(axis = gather_20_axis_0, indices = gather_20_indices_0, x = var_258_shape_cast);
            tensor<int32, []> concat_11_axis_0 = const()[name = tensor<string, []>("concat_11_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_11_interleave_0 = const()[name = tensor<string, []>("concat_11_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_11 = concat(axis = concat_11_axis_0, interleave = concat_11_interleave_0, values = (gather_19, gather_20, var_7, var_6));
            tensor<fp16, [?, ?, 12, 32]> x_27_cast = reshape(shape = concat_11, x = x_25_cast);
            tensor<fp16, [384, 384]> model_encoder_layer_2_attention_self_value_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_2_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(200116608)))];
            tensor<fp16, [384]> model_encoder_layer_2_attention_self_value_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_layer_2_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(200411584)))];
            tensor<fp16, [?, ?, 384]> x_29_cast = linear(bias = model_encoder_layer_2_attention_self_value_bias_to_fp16, weight = model_encoder_layer_2_attention_self_value_weight_to_fp16, x = input_53_cast);
            tensor<int32, [3]> var_267_shape_cast = shape(x = x_29_cast);
            tensor<int32, []> gather_21_indices_0 = const()[name = tensor<string, []>("gather_21_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_21_axis_0 = const()[name = tensor<string, []>("gather_21_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_21 = gather(axis = gather_21_axis_0, indices = gather_21_indices_0, x = var_267_shape_cast);
            tensor<int32, []> gather_22_indices_0 = const()[name = tensor<string, []>("gather_22_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_22_axis_0 = const()[name = tensor<string, []>("gather_22_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_22 = gather(axis = gather_22_axis_0, indices = gather_22_indices_0, x = var_267_shape_cast);
            tensor<int32, []> concat_12_axis_0 = const()[name = tensor<string, []>("concat_12_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_12_interleave_0 = const()[name = tensor<string, []>("concat_12_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_12 = concat(axis = concat_12_axis_0, interleave = concat_12_interleave_0, values = (gather_21, gather_22, var_7, var_6));
